Examinator/src/DataProcessors/РасписаниеПользователейСУО/РасписаниеПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасписаниеПользователейСУО</name>
</mdclass:DataProcessor>

Examinator/src/InformationRegisters/РасписаниеОбученияСУО/РасписаниеОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеОбученияСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗавершеноВПроцентах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущиеБаллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Актуально</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПрохожденияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроцессаОбучения</name>
    <type>
      <types>EnumRef.СтатусыПроцессаОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроведения</name>
    <type>
      <types>EnumRef.СтатусыПроведенияОбъектовСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПрохождения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппыСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МероприятиеСОднимЭлектроннымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеПрограммыОбучения</name>
    <type>
      <types>DocumentRef.ПрохождениеПрограммыОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/РасписаниеПреподавателейСУО/РасписаниеПреподавателейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеПреподавателейСУО</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ДатаНачалаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проведено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>РодительскоеПроведение</name>
    <type>
      <types>DocumentRef.ПроведениеПреподавателемОбученияСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветНаКалендаре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>DefinedType.СценарийОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/DataProcessors/РасписаниеПользователейСУО/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура СформироватьРасписаниеПользователей()
	
	// Делаем проверки
	//
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Текст = НСтр("ru = 'Не задан период! Расписание не может быть сформировано.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
		Возврат;
	КонецЕсли;
	
	// Очищаем данные
	//
	
	Расписание.Очистить();
	ТаблицаРасписания.ПолучитьЭлементы().Очистить();
	
	// Устанавливаем масштаб
	//
	
	Расписание.АвтоОпределениеПолногоИнтервала = Ложь;
	Расписание.УстановитьПолныйИнтервал(Период.ДатаНачала, Период.ДатаОкончания);
	
	// Добавляем шкалы
	//
	
	Шкалы = Расписание.ОбластьПостроения.ШкалаВремени.Элементы;
	
	Для каждого Шкала Из Шкалы Цикл
		Шкалы.Удалить(Шкала);
	КонецЦикла;
	
	// Примечание: нельзя удалить все шкалы, поэтому в дальнейшем основную шкалу получаем ее индексу.
	
	Если Масштаб = "Месяц" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Год;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
	КонецЕсли;
	
	Если Масштаб = "Неделя" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Неделя;
		
	КонецЕсли;
	
	Если Масштаб = "День" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Месяц;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.День;
		
	КонецЕсли;
	
	
	Если Масштаб = "Час" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.День;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Час;
		
	КонецЕсли;
	
	
	Если Масштаб = "Минута" Тогда
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Получить(0);
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.День;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Час;
		
		НоваяШкалаВремени = Расписание.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
		НоваяШкалаВремени.Единица = ТипЕдиницыШкалыВремени.Минута;
		НоваяШкалаВремени.Кратность = 5;
		
	КонецЕсли;
	
	// Добавляем серии
    //
	
	СерияОбучение          = Расписание.УстановитьСерию("Обучение");
	СерияОбучение.Цвет     = Новый Цвет(51, 102, 204);
	
	СерияПреподавание      = Расписание.УстановитьСерию("Преподавание");
	СерияПреподавание.Цвет = Новый Цвет(00, 100, 00);
	
	СерияСобытия           = Расписание.УстановитьСерию("События");
	СерияСобытия.Цвет      = Новый Цвет(178, 34, 34);
	
	// Добавляем точки
	//
	
	МассивПользователей = Новый Массив();
	
	Для каждого Строка Из ТаблицаПользователей Цикл
		МассивПользователей.Добавить(Строка.Пользователь);
	КонецЦикла;
	
	ВыборкаОбучение     = РегистрыСведений.РасписаниеОбученияСУО.ВыбратьЭлементыРасписания(МассивПользователей, Период.ДатаНачала, Период.ДатаОкончания);
	ВыборкаПреподавание = РегистрыСведений.РасписаниеПреподавателейСУО.ВыбратьЭлементыРасписания(МассивПользователей, Период.ДатаНачала, Период.ДатаОкончания);
	
	Для каждого Пользователь Из МассивПользователей Цикл
	
		НоваяТочка = Расписание.УстановитьТочку(Пользователь); 
		
		СтруктураПоиска = Новый Структура("Пользователь", Пользователь);
		
		СтрокаРодитель = ТаблицаРасписания.ПолучитьЭлементы().Добавить();
		СтрокаРодитель.Пользователь = Пользователь;
		
		// Обучение
		
		ВыборкаОбучение.Сбросить();
		
		ЗначениеДиаграммы = Расписание.ПолучитьЗначение(НоваяТочка, СерияОбучение);
		
		Пока ВыборкаОбучение.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаОбучение.ДатаНачалаПроведения) Тогда
				Продолжить;
			КонецЕсли;
			
			Интервал = ЗначениеДиаграммы.Добавить();
			Интервал.Начало      = ВыборкаОбучение.ДатаНачалаПроведения;
			Интервал.Конец       = ВыборкаОбучение.ДатаОкончанияПроведения;
			Интервал.Расшифровка = ВыборкаОбучение.ПрохождениеОбучения;
			
			Строка = СтрокаРодитель.ПолучитьЭлементы().Добавить();
			Строка.Пользователь          = Пользователь;
			Строка.ЭлементРасписания     = ВыборкаОбучение.ПрохождениеОбучения;
			Строка.ТипЭлементаРасписания = "Обучение";
			Строка.ДатаНачала            = ВыборкаОбучение.ДатаНачалаПроведения;
			Строка.ДатаОкончания         = ВыборкаОбучение.ДатаОкончанияПроведения;
			
		КонецЦикла;
				
		// Преподавание
		
		ВыборкаПреподавание.Сбросить();
		
		ЗначениеДиаграммы = Расписание.ПолучитьЗначение(НоваяТочка, СерияПреподавание);
		
		Пока ВыборкаПреподавание.НайтиСледующий(СтруктураПоиска) Цикл
			
			Если НЕ ЗначениеЗаполнено(ВыборкаПреподавание.ДатаНачалаПроведения) Тогда
				Продолжить;
			КонецЕсли;
			
			Интервал = ЗначениеДиаграммы.Добавить();
			Интервал.Начало      = ВыборкаПреподавание.ДатаНачалаПроведения;
			Интервал.Конец       = ВыборкаПреподавание.ДатаОкончанияПроведения;
			Интервал.Расшифровка = ВыборкаПреподавание.ПроведениеОбученияПреподавателем;
			
			Строка = СтрокаРодитель.ПолучитьЭлементы().Добавить();
			Строка.Пользователь          = Пользователь;
			Строка.ЭлементРасписания     = ВыборкаПреподавание.ПроведениеОбученияПреподавателем;
			Строка.ТипЭлементаРасписания = "Преподавание";
			Строка.ДатаНачала            = ВыборкаПреподавание.ДатаНачалаПроведения;
			Строка.ДатаОкончания         = ВыборкаПреподавание.ДатаОкончанияПроведения;
			
		КонецЦикла;		
		
		Расписание.РазвернутьТочку(НоваяТочка, Истина);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьСписокПользователейВХранилище()
	
	ТаблицаЗначенийПользователей = РеквизитФормыВЗначение("ТаблицаПользователей");
	
	ЗаголовокФормыПодбора = НСтр("ru = 'Подбор пользователей'");
	ПараметрыРасширеннойФормыПодбора = 
		Новый Структура("ЗаголовокФормыПодбора, ВыбранныеПользователи, ПодборГруппНевозможен",
		                 ЗаголовокФормыПодбора, ТаблицаЗначенийПользователей, Истина);
	АдресХранилища = ПоместитьВоВременноеХранилище(ПараметрыРасширеннойФормыПодбора, УникальныйИдентификатор);
	Возврат АдресХранилища;		
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Читаем настройки
	
	ДанныеНастроек = ХранилищеСистемныхНастроек.Загрузить(ИмяФормы+"/ТекущиеДанные");
	
	Если ДанныеНастроек = Неопределено Тогда
		
		Период.Вариант = ВариантСтандартногоПериода.Сегодня;
		Масштаб        = "День";
		
		НоваяСтрока = ТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
		
	КонецЕсли;
	
	// Задаем облать построения диаграммы
	
	Расписание.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Авто;
	
	// Заголовок
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок     = НСтр("ru = 'События пользователя (установлен дополнительный отбор)'");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Примечание: изменение реквизитов и формирование диаграммы
	// Делаем в обработчике ПриОткрытии после восстановление платформой
	// Данных из хранилища настроек.
	
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		
		ТаблицаПользователей.Очистить();
		
		НоваяСтрока = ТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = Параметры.Пользователь;
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Период) Тогда
		
		Период = Параметры.Период;
		
	КонецЕсли;
	
	// Формируем диаграмму Ганта и таблицу
	
	СформироватьРасписаниеПользователей();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив")
		ИЛИ ТипЗнч(ИсточникВыбора) <> Тип("УправляемаяФорма") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ТаблицаПользователей.Очистить();
	
	Для каждого ВыбранныйПользователь Из ВыбранноеЗначение Цикл
		
		НоваяСтрока = ТаблицаПользователей.Добавить();
		НоваяСтрока.Пользователь = ВыбранныйПользователь;		
		
	КонецЦикла;
	
	СформироватьРасписаниеПользователей();	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура Подбор(Команда)
	
	АдресСпискаВХранилище = ПоместитьСписокПользователейВХранилище();
	
	ПараметрыФормы = Новый Структура("ПараметрыРасширеннойФормыПодбора, РасширенныйПодбор", АдресСпискаВХранилище, Истина);
	ОткрытьФорму("ОбщаяФорма.ПодборПользователейСУО", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	СформироватьРасписаниеПользователей();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ТаблицаПользователей.Очистить();
	СформироватьРасписаниеПользователей();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформироватьРасписаниеПользователей();
КонецПроцедуры

&НаКлиенте
Процедура МасштабПриИзменении(Элемент)
	СформироватьРасписаниеПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРасписанияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.ЭлементРасписания) Тогда
		ПоказатьЗначение(,ТекущиеДанные.ЭлементРасписания);
	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ ТаблицаРасписания
